
% Æò±Õ º¤ÅÍ
m1=[1; 1];
m2=[7; 7];
m3=[15; 1];

% °øºÐ»ê Çà·Ä
S1=[12 0; 0 1];
S2=[8 3; 3 2];
S3=[2 0; 0 2];

v1_1=mvnrnd(m1,S1,0.33*1000);
v1_2=mvnrnd(m2,S2,0.33*1000);
v1_3=mvnrnd(m3,S3,0.34*1000);

figure(1);
hold on;
scatter(v1_1(:,1),v1_1(:,2),'r');
scatter(v1_2(:,1),v1_2(:,2),'g');
scatter(v1_3(:,1),v1_3(:,2),'b');

% »çÀü È®·ü
P=[0.6; 0.3; 0.1];

v2_1=mvnrnd(m1,S1,P(1)*1000);
v2_2=mvnrnd(m2,S2,P(2)*1000);
v2_3=mvnrnd(m3,S3,P(3)*1000);

figure(2);
hold on;
scatter(v2_1(:,1),v2_1(:,2),'r');
scatter(v2_2(:,1),v2_2(:,2),'g');
scatter(v2_3(:,1),v2_3(:,2),'b');

